# GetVPClOvrdLnWeight

```pascal
FUNCTION GetVPClOvrdLnWeight(
				viewportHandle : HANDLE;
				className      : STRING): INTEGER;
```

```python
def vs.GetVPClOvrdLnWeight(viewportHandle, className):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The handle of the viewport|
|className|STRING|The name of the class override|

## Version
Availability: from Vectorworks 2018

## Category
* Viewports